一、个人基本情况介绍


二、绩效贡献
1.责任
a)参与项目需求分析，研究项目技术细节，进行系统框架和核心模块的详细设计；编写相应的技术文档； 
b)根据每月下发的PO，开发相应的软件模块；根据需要及时修改、完善软件；
c)根据公司要求规范，编写相应的技术文档；编制项目文档、记录质量测试结果；
d)研究项目技术细节；完成项目初始至终结的全部技术跟踪协调工作；
e)根据开发进度和任务分解完成软件编码工作，配合测试工程师进行软件测试工作；
g)参与客户沟通、项目需求调研分析并维持良好的客户关系；编写需求分析报告。
h)完成公司领导交办的其他工作。

2.专业回馈
本人在工作中认真负责，积极主动，服从整体安排，爱岗敬业，业务知识扎实，为公司业务创造更多机会和效益，受公司客户及合作企业好评，为公司创造出较好的企业效益或社会效益

三、关键能力


四、待改进点


绩效贡献
工作成果举例
成果名称
全局分布式缓存&会话集群自动创建和集群重要指标监控

所属模块
全局分布式缓存&会话

背景
手动搭建redis集群步骤多，配置繁琐，耗时长；且集群没有自动监控功能，一旦出现故障，需要花费大量时间排查故障，无法快速定位问题，快速恢复服务，给客户造成巨大损失

措施
采用自动发布加动态脚本的方式，让用户通过简单的操作页面，实现可定制的集群创建。
集群搭建完成后，同时在每个节点安装一个指标采集工具，每分钟采集一次redis集群的重要指标，上报到消息队列；后端程序订阅topic将数据存入指定的Redis集群，为监控图表提供监控数据。

本人在其中的角色
本人负责该模块的所有工作

工作成果


关键能力举例-技术能力

